{ 
    "destinations": [
        { 
            "id": 1,
            "name": "Paris",
            "country": "France",
            "image": "images/Paris/paris-medium.jpg",
            "image_large": "images/Paris/paris-large.jpg",
            "description": "Paris is a major European city and a global center for art, fashion, gastronomy and culture.",
            "details": {
                "long_description": "Paris is the capital and largest city of France. It is a major European city and has become one of the world's most popular tourist destinations.",
                "population": "2.141 million",
                "area": "105 square kilometers",
                "language": "French",
                "currency": "Euro",
                "popularDestinations": [
                    "Eiffel Tower",
                    "Louvre Museum",
                    "Notre-Dame Cathedral",
                    "Palace of Versailles",
                    "Montmartre",
                    "Seine River Cruise"
                ],
                "location": {
                    "latitude": 48.8566,
                    "longitude": 2.3522
                }
            }
        },
        {
            "id": 2,
            "name": "London",
            "country": "United Kingdom",
            "image": "images/London/london-medium.jpg",
            "image_large": "images/London/london-large.jpg",
            "description": "London, the capital of England and the United Kingdom, is a 21st-century city with history stretching back to Roman times.",
            "details": {
                "long_description": "London, the capital of the United Kingdom, is a dynamic and multicultural city with a rich history dating back to Roman times. Situated on the River Thames, it is a global center for politics, culture, and commerce. Famous landmarks include Buckingham Palace, the Tower of London, and the Houses of Parliament. The city is home to world-class museums like the British Museum and Tate Modern, attracting millions of visitors each year. Known for its diversity, London also has a thriving arts scene, from West End theater to music festivals. As a financial hub, it houses major institutions like the London Stock Exchange. London blends historical charm with modern innovation, offering both green spaces like Hyde Park and a cutting-edge skyline with skyscrapers like The Shard. The city’s extensive transport system makes it easy to navigate, connecting visitors to its many cultural and historical attractions.",
                "population": "Approx. 9 million",
                "area": "1,572 square kilometers (607 square miles)",
                "language": "English",
                "currency": "British Pound",
                "popularDestinations": [
                    "The British Museum",
                    "Big Ben",
                    "Buckingham Palace",
                    "Tower of London",
                    "London Eye",
                    "Westminster Abbey"
                ],
                "location": {
                    "latitude": 51.50807,
                    "longitude": -0.12776
                }
            }
        },
        {
            "id":3,
            "name": "Porto",
            "country": "Portugal",
            "image": "images/Porto/porto-medium.jpg",
            "image_large": "images/Porto/porto-large.jpg",
            "description": "Porto is a coastal city in northwest Portugal known for its stately bridges and port wine production.",
            "details": {
                "long_description": "Porto is a coastal city in northwest Portugal known for its stately bridges and port wine production. In the medieval Ribeira (riverside) district, narrow cobbled streets wind past merchants’ houses and cafes. São Francisco Church is known for its lavish baroque interior with ornate gilded carvings. The palatial 19th-century Palácio de Bolsa, formerly a stock market, was built to impress potential European investors.",
                "population": "231,800",
                "area": "2,395 square kilometers (925 square miles)",
                "language": "Portuguese",
                "currency": "Euro",
                "popularDestinations": [
                    "Luís I Bridge",
                    "Torre dos Clérigos",
                    "Douro River",
                    "Cais da Ribeira",
                    "Palácio da Bolsa"
                ],
                "location": {
                    "latitude": 41.15132,
                    "longitude": -8.61079
                }
            }
        },
        {
            "id":4,
            "name": "Rome",
            "country": "Italy",
            "image": "images/Rome/rome-medium.jpg",
            "image_large": "images/Rome/rome-large.jpg",
            "description": "Rome is the capital city of Italy and a major historical and cultural center in Europe.",
            "details": {
                "long_description": "Rome, historic city and capital of Roma provincia (province), of Lazio regione (region), and of the country of Italy. Rome is located in the central portion of the Italian peninsula, on the Tiber River about 15 miles (24 km) inland from the Tyrrhenian Sea. Once the capital of an ancient republic and empire whose armies and polity defined the Western world in antiquity and left seemingly indelible imprints thereafter, the spiritual and physical seat of the Roman Catholic Church, and the site of major pinnacles of artistic and intellectual achievement, Rome is the Eternal City, remaining today a political capital, a religious centre, and a memorial to the creative imagination of the past.",
                "population": "2.86 million",
                "area": "1,285 square kilometers (496 square miles)",
                "language": "Italian",
                "currency": "Euro",
                "popularDestinations": [
                    "Colosseum",
                    "Trevi Fountain",
                    "Pantheon",
                    "Roman Forum",
                    "Palatine Hill"
                ],
                "location": {
                    "latitude": 41.9145,
                    "longitude": 12.4791
                }
            }
        },
        {
            "id":5,
            "name": "Madrid",
            "country": "Spain",
            "image": "images/Madrid/madrid-medium.jpg",
            "image_large": "images/Madrid/madrid-large.jpg",
            "description": "Madrid is the capital and most populous municipality of Spain. It is the second-largest city in the European Union.",
            "details": {
                "long_description": "Madrid, Spain's central capital, is a city of elegant boulevards and expansive, manicured parks such as the Buen Retiro. It’s renowned for its rich repositories of European art, including the Prado Museum’s works by Goya, Velázquez and other Spanish masters. The heart of old Hapsburg Madrid is the portico-lined Plaza Mayor, and nearby is the baroque Royal Palace and Armory, displaying historic weaponry.",
                "population": "3.277 million",
                "area": "604.3 square kilometers (233.3 square miles)",
                "language": "Spanish",
                "currency": "Euro",
                "popularDestinations": [
                    "Royal Palace of Madrid",
                    "Plaza Mayor",
                    "El Rertiro Park",
                    "Museo Nacional del Prado"
                ],
                "location": {
                    "latitude": 40.41725,
                    "longitude": -3.70329
                }
            }
        }
    ]
}